# RebarPropagation Class

---
An utility class containing functions that can be used to propagate rebar elements.
SystemObject Autodesk.Revit.DB.StructureRebarPropagation
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public static class RebarPropagation

    Public NotInheritable Class RebarPropagation

    public ref class RebarPropagation abstract sealed

    [<AbstractClassAttribute>]
    [<SealedAttribute>]
    type RebarPropagation = class end
The RebarPropagation type exposes the following members.
| Name| Description
---|---|---
| AlignByFace|
| AlignByHost|
Top
#### Reference
Autodesk.Revit.DB.Structure Namespace